app/views/messages/index.html.erb

    <% if message.body %>
      <% user = User.find(message.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]