app/views/orders/_form.html.erb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      </div>
      <% if current_user.purchases.map{|o| o.item.id }.include? item.id %>