app/views/items/index.html.erb

      </div>
      <% if current_user.purchases.map{|o| o.item.id }.include? item.id %>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]