app/controllers/items_controller.rb

  def create
    @item = current_user.items.build(item_params)
    @item.seller_id = current_user.id
    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "price", "description", "location", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "seller_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "price" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["price", #<BigDecimal:7fdd251911d0,'0.25E3',9(18)>], ["updated_at", 2017-03-08 23:50:04 UTC], ["id", 1]]