app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = ?  [["buyer_id", 7]]
SELECT "items".* FROM "items"
---
  def index
    @orders = Order.where(buyer_id: current_user.id)
    @items = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @item = Item.find(params[:item])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("buyer_id", "seller_id", "status", "created_at", "updated_at", "item_id") VALUES (?, ?, ?, ?, ?, ?)  [["buyer_id", 1], ["seller_id", 1], ["status", "Order request sent"], ["created_at", 2017-03-08 17:15:17 UTC], ["updated_at", 2017-03-08 17:15:17 UTC], ["item_id", 3]]
---
  def create
    @item = Item.find(params[:item])
    @order = Order.new(
      buyer_id: current_user.id,
      seller_id: @item.seller_id,
      status: "Order request sent",
      item_id: @item.id
      )

    respond_to do |format|
      if @order.save